In [35]:
import numpy as np  
import pandas as pd

a = pd.Series(np.arange(5),name='a')
b =  pd.Series(np.arange(5,10),name='b')
print(a, b)

0    0
1    1
2    2
3    3
4    4
Name: a, dtype: int64 0    5
1    6
2    7
3    8
4    9
Name: b, dtype: int64

In [ ]:
#1 et 2

a = pd.Series(np.arange(5),name='a')
b = pd.Series(np.arange(5,10),name='b')

ajout = a + b
sous = a - b
mult = a * b
div = a / b

print("Addition :\n",ajout)
print("Soustraction :\n", sous)
print("multiplication :\n", mult)
print("division :\n", div)

# On remarque dans les quatre cas que les valeurs ce sont ajoutées, soustrait, multipliées et divisées.

In [37]:
#3
pd.Series(sous).sort_values()

0   -5
1   -5
2   -5
3   -5
4   -5
dtype: int64

In [39]:
#4

data ={
    "na": pd.Series(np.arange(5),name='a')
} 
df = pd.DataFrame(data)
df[df['na'] < 3]

   na
0   0
1   1
2   2

In [101]:
#5

exam_data = {'nom': ['Caroline', 'Steve', 'Martin', 'Chris', 'Diane', 'Simon', 'Matt', 'Nadia',
                    'Ethan', 'Antony'],
            'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
            'tentatives': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
            'recu': ['oui', 'non', 'oui', 'non', 'non', 'oui', 'oui', 'non', 'non', 'oui']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data , index=labels)
df.iloc[:3]

        nom  score  tentatives recu
a  Caroline   12.5           1  oui
b     Steve    9.0           3  non
c    Martin   16.5           2  oui

In [102]:
#6

df[df['score'].isna()]

     nom  score  tentatives recu
d  Chris    NaN           3  non
h  Nadia    NaN           1  non

In [103]:
#7

df[(df['score'] > 15) & (df['tentatives'] < 2)]

      nom  score  tentatives recu
j  Antony   19.0           1  oui

In [104]:
#8

df[['nom', 'score']]

        nom  score
a  Caroline   12.5
b     Steve    9.0
c    Martin   16.5
d     Chris    NaN
e     Diane    9.0
f     Simon   20.0
g      Matt   14.5
h     Nadia    NaN
i     Ethan    8.0
j    Antony   19.0

In [105]:
#9

df.loc[['b','d','f','g'],['score', 'recu']]

   score recu
b    9.0  non
d    NaN  non
f   20.0  oui
g   14.5  oui

In [106]:
#10

print("Le nombre de colonnes est de : " + str(len(df.columns)))
print("Le nombre de rangées est de : " + str(len(df)))
df.shape

Le nombre de colonnes est de : 4
Le nombre de rangées est de : 10

(10, 4)

In [107]:
#11

res = df["tentatives"].sum()
print("Le nombre de tentatives total est :",res)

Le nombre de tentatives total est : 19

In [110]:
#12

res = df.groupby('nom')['tentatives'].sum()
print("Nombre de tentatives par étudiant :\n",res)

Nombre de tentatives par étudiant :
 nom
Antony      1
Caroline    1
Chris       3
Diane       2
Ethan       2
Martin      2
Matt        1
Nadia       1
Simon       3
Steve       3
Name: tentatives, dtype: int64

In [111]:
#13

res = df.sort_values(['nom','score'] , ascending=[True, False])
print(res)

        nom  score  tentatives recu
j    Antony   19.0           1  oui
a  Caroline   12.5           1  oui
d     Chris    NaN           3  non
e     Diane    9.0           2  non
i     Ethan    8.0           2  non
c    Martin   16.5           2  oui
g      Matt   14.5           1  oui
h     Nadia    NaN           1  non
f     Simon   20.0           3  oui
b     Steve    9.0           3  non

In [112]:
#14

data = {
    'Premiere serie' : [100, 200, 'python', 300.12, 400],
    'Deuxieme serie' : [10, 20, 'php', 30.12, 40],
}
pd.DataFrame(data)

  Premiere serie Deuxieme serie
0            100             10
1            200             20
2         python            php
3         300.12          30.12
4            400             40

In [113]:
#15

dict1 = {'Nom': ['Jean', 'Louis', 'Diane', 'Jeanne'],
'Taille': [180, 184, 170, 171],
'Age': [23, 21, 22, 22],
'Poids': [73, 71, 51, 52],
'Sexe': ['H', 'H', 'F', 'F'],
'Annee': [1990, 1992, 1998, 1995]}
df = pd.DataFrame(dict1)
print("L'age maximal est de", df["Age"].max(), "ans")

L'age maximal est de 23 ans

In [114]:
#16
df.loc[df['Taille'] == df['Taille'].min(),['Nom', 'Taille', 'Poids', 'Age'] ]

     Nom  Taille  Poids  Age
2  Diane     170     51   22

In [117]:
#17

df.groupby(['Sexe', 'Age']).mean()

<ipython-input-117-52b690d8f067>:3: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(['Sexe', 'Age']).mean()

          Taille  Poids   Annee
Sexe Age
F    22    170.5   51.5  1996.5
H    21    184.0   71.0  1992.0
     23    180.0   73.0  1990.0

In [93]:
#18

res = df.groupby(['Sexe'])["Taille"].mean()
print(res)

Sexe
F    170.5
H    182.0
Name: Taille, dtype: float64

In [94]:
#19

df['Deviation'] = df.groupby('Sexe')["Taille"].apply(lambda x: x - x.mean())
print(df)

      Nom  Taille  Age  Poids Sexe  Annee  Deviation
0    Jean     180   23     73    H   1990       -2.0
1   Louis     184   21     71    H   1992        2.0
2   Diane     170   22     51    F   1998       -0.5
3  Jeanne     171   22     52    F   1995        0.5

<ipython-input-94-afa3bb1a74af>:3: FutureWarning: Not prepending group keys to the result index of transform-like apply. In the future, the group keys will be included in the index, regardless of whether the applied function returns a like-indexed object.
To preserve the previous behavior, use

	>>> .groupby(..., group_keys=False)

To adopt the future behavior and silence this warning, use

	>>> .groupby(..., group_keys=True)
  df['Deviation'] = df.groupby('Sexe')["Taille"].apply(lambda x: x - x.mean())

In [4]:
#20

df = pd.DataFrame({
'numero':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'montant':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45,
5.29,3045.6],
'date': ['05-10-2012','05-10-2012','05-10-2013','08-17-2013','08-17-2013','07-27-2014','10-09-2012','10-10-2012','10-10-2012','06-17-2014','04-25-2012','04-25-2012'],
'idclient':[3001,3001,3005,3001,3005,3001,3005,3001,3005,3001,3005,3005],
'idvendeur': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

df.groupby(['date'])['montant'].sum()

date
04-25-2012    3050.89
05-10-2012     421.15
05-10-2013      65.26
06-17-2014     250.45
07-27-2014    2400.60
08-17-2013    1059.00
10-09-2012    5760.00
10-10-2012    4463.83
Name: montant, dtype: float64